[
  {
    "href": "/posts/2015-11-30-building-and-shipping-functional-css",
    "frontmatter": {
      "title": "Building and Shipping Functional CSS",
      "date": "2015-11-30T00:00:00.000Z",
      "excerpt": "A case study in adopting functional CSS"
    }
  },
  {
    "href": "/posts/2022-08-12-an-introduction-to-constraint-based-design-systems",
    "frontmatter": {
      "title": "An Introduction to Constraint Based Design Systems",
      "date": "2022-08-12T00:00:00.000Z",
      "excerpt": "Effective designs optimize for constraints. These constraints are not just useful, they are critical: a beautiful building not designed for the constraints of tectonic movement and climate variability will collapse, and products not designed for the myriad constraints of the web will never amass a critical user base. Furthermore, a design system without adequate constraints will quickly grow into a disordered mess, especially as more contributors join in and more design problems are encountered."
    }
  },
  {
    "href": "/posts/2023-01-10-past-informs-the-present-begins-approach-to-css",
    "frontmatter": {
      "title": "Past Informs the Present: Begin’s Approach to CSS",
      "date": "2023-01-10T00:00:00.000Z",
      "excerpt": "A brief recap of some of the history and evolution of CSS, with a focus on several methodologies — some battle tested, some more recent — for making the process of styling web apps and components both enjoyable and effective.",
      "canonicalSite": "Begin",
      "canonicalUrl": "https://begin.com/blog/posts/2023-01-10-past-informs-the-present-our-approach-to-css"
    }
  },
  {
    "href": "/posts/2023-02-28-redefining-developer-experience",
    "frontmatter": {
      "title": "Redefining Developer Experience",
      "date": "2023-02-28T00:00:00.000Z",
      "excerpt": "For years now, the most popular JS frameworks have carried out intense marketing initiatives based on the premise of improving developer experience (DX). What is it about these promises of great DX that is consistently delivering poor user experiences? Can we change our approach to DX for the betterment of end users?",
      "canonicalSite": "Begin",
      "canonicalUrl": "https://begin.com/blog/posts/2023-02-28-redefining-developer-experience"
    }
  },
  {
    "href": "/posts/2023-10-16-briefly-on-systems",
    "frontmatter": {
      "title": "Briefly, On Systems",
      "date": "2023-10-16T00:00:00.000Z",
      "excerpt": "Some things I’ve learned over the course of my life and career in regards to building systems (design, web, software, interpersonal, whatever), which may or may not be applicable to everyone."
    }
  },
  {
    "href": "/posts/2024-02-08-patterns-for-style-composition-with-html-and-web-components",
    "frontmatter": {
      "title": "Patterns for Style Composition with HTML and Web Components",
      "date": "2024-02-08T00:00:00.000Z",
      "excerpt": "A detailed documentation of how I approach the challenges of design engineering"
    }
  }
]